cf_billing/InformationRegisters/бестТехническаяВозможностьУстановкиПУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестТехническаяВозможностьУстановкиПУ</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НетВозможностьУстановкиПУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестТехническаяВозможностьУстановкиПУ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает возможность установки ПУ.
//
// Параметры:
//  Период		-	Дата.
//  Организация	-	СправочникСсылка.Организации.
//  Район		-	СправочникСсылка.энргЗоныОтвественности.
//  ТочкаУчета	-	СправочникСсылка.энргТочкиУчета.
// 
// Возвращаемое значение:
//   Булево.
//
Функция ПолучитьВозможностьУстановкиПУ(Период, Организация, Район, ТочкаУчета) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестТехническаяВозможностьУстановкиПУСрезПоследних.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ
		|ИЗ
		|	РегистрСведений.бестТехническаяВозможностьУстановкиПУ.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И ТочкаУчета = &ТочкаУчета) КАК бестТехническаяВозможностьУстановкиПУСрезПоследних";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Район", Район);
	Запрос.УстановитьПараметр("ТочкаУчета", ТочкаУчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.НетВозможностьУстановкиПУ;
	КонецЦикла;

	Возврат Ложь;
КонецФункции

#КонецОбласти

#КонецЕсли
